goods = [
    (1, {'название': 'компьютер', 'цена': '20000', 'количество': 5, 'ед': 'шт'}),
    (2, {'название': 'принтер', 'цена': '6000', 'количество': 2, 'ед': 'шт'}),
    (3, {'название': 'сканер', 'цена': '2000', 'количество': 7, 'ед': 'шт'})]

goods_set_1 = goods[0]
goods_set_2 = goods[1]
goods_set_3 = goods[2]

goods_dict_1 = goods_set_1[1]
goods_dict_2 = goods_set_2[1]
goods_dict_3 = goods_set_3[1]

#  дальше перепробовала все варианты для склеивания словарей или добавления в ключи первого словаря значений из 2 и 3 словаря, но не выходит. Буду благодарна если поможете подсказать как можно дописать, или посмотрю на уроке как можно сделать. Но ощущение, что через setdefault это можно провернуть)
